# MÃ©todo GroupBy

- 1. Agrupamento de Dados
    - usando groupby
    - agg()

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [2]:
# criando um dataframe

data = {'Empresa':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Venda':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

## 1. Agrupamento de dados

In [3]:
group = df.groupby('Empresa')

In [4]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [ ]:
group

In [ ]:
# Soma de vendas por empresa
group.sum()

In [ ]:
# Soma de vendas por empresa
group.agg({'Venda':'sum'})

In [ ]:
# Soma de vendas por empresa
group.agg({'Venda':['sum','min', 'max', 'std', 'median','unique', 'nunique']})

In [ ]:
# Apresenta uma descriÃ§Ã£o estatÃ­stica da tabela incluÃ­ndo count, mean, std
group.describe()

In [ ]:
group.agg(pd.Series.mode)

In [ ]:
group.first()

In [ ]:
group.last()

In [ ]:
group.apply(lambda grp: grp.count() / df.shape[0])